Ran Plan for project: `production` dir: `prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.path_redirects["proteomics.broadapps.org"].google_compute_global_forwarding_rule.global_forwarding_https_rule will be created
+ resource "google_compute_global_forwarding_rule" "global_forwarding_https_rule" {
+       base_forwarding_rule  = (known after apply)
+       effective_labels      = (known after apply)
+       forwarding_rule_id    = (known after apply)
+       id                    = (known after apply)
+       ip_address            = "34.98.91.130"
+       ip_protocol           = (known after apply)
+       label_fingerprint     = (known after apply)
+       load_balancing_scheme = "EXTERNAL"
+       name                  = "proteomics-broadapps-org-global-forwarding-https-rule"
+       network               = (known after apply)
+       network_tier          = (known after apply)
+       port_range            = "443"
+       project               = "broad-redirect-prod"
+       psc_connection_id     = (known after apply)
+       psc_connection_status = (known after apply)
+       self_link             = (known after apply)
+       subnetwork            = (known after apply)
+       target                = (known after apply)
+       terraform_labels      = (known after apply)

+       service_directory_registrations (known after apply)
    }

  # module.path_redirects["proteomics.broadapps.org"].google_compute_target_https_proxy.https_proxy will be created
+ resource "google_compute_target_https_proxy" "https_proxy" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       name               = "proteomics-broadapps-org-https-proxy"
+       project            = "broad-redirect-prod"
+       proxy_bind         = (known after apply)
+       proxy_id           = (known after apply)
+       quic_override      = "NONE"
+       self_link          = (known after apply)
+       ssl_certificates   = [
+           "https://www.googleapis.com/compute/v1/projects/broad-redirect-prod/global/sslCertificates/proteomics-broadapps-org-managed-certificate",
        ]
+       tls_early_data     = (known after apply)
+       url_map            = (known after apply)
    }

  # module.path_redirects["proteomics.broadapps.org"].google_compute_url_map.https_url_map will be created
+ resource "google_compute_url_map" "https_url_map" {
+       creation_timestamp = (known after apply)
+       fingerprint        = (known after apply)
+       id                 = (known after apply)
+       map_id             = (known after apply)
+       name               = "proteomics-broadapps-org-https-url-map"
+       project            = "broad-redirect-prod"
+       self_link          = (known after apply)

+       default_url_redirect {
+           host_redirect          = "www.broadinstitute.org"
+           https_redirect         = false
+           path_redirect          = "/"
+           redirect_response_code = "TEMPORARY_REDIRECT"
+           strip_query            = false
        }

+       host_rule {
+           hosts        = [
+               "proteomics.broadapps.org",
            ]
+           path_matcher = "allpaths"
            # (1 unchanged attribute hidden)
        }

+       path_matcher {
+           name = "allpaths"

+           default_url_redirect {
+               host_redirect          = "www.broadinstitute.org"
+               https_redirect         = false
+               path_redirect          = "/"
+               redirect_response_code = "TEMPORARY_REDIRECT"
+               strip_query            = false
            }

+           path_rule {
+               paths = [
+                   "/CPTAC-LSCC2021",
                ]

+               url_redirect {
+                   host_redirect          = "proteogenomics.shinyapps.io"
+                   https_redirect         = true
+                   path_redirect          = "/cptac-LSCC2021-viewer/"
+                   redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+                   strip_query            = false
                }
            }
+           path_rule {
+               paths = [
+                   "/CPTAC-MONTE2022",
                ]

+               url_redirect {
+                   host_redirect          = "proteogenomics.shinyapps.io"
+                   https_redirect         = true
+                   path_redirect          = "/cptac-MONTE2022-viewer/"
+                   redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+                   strip_query            = false
                }
            }
+           path_rule {
+               paths = [
+                   "/ptmsigdb",
                ]

+               url_redirect {
+                   host_redirect          = "proteogenomics.shinyapps.io"
+                   https_redirect         = true
+                   path_redirect          = "/ptmsigdb/"
+                   redirect_response_code = "MOVED_PERMANENTLY_DEFAULT"
+                   strip_query            = false
                }
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p production
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://atlantis-devnull.broadinstitute.org/lock?id=broadinstitute%252Fterraform-broad-redirect%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p production
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```